# -*- coding: utf-8 -*-


# ----------------------------------------
# 算术运算符：+、-、*、/、%、**、//
# ----------------------------------------
a = 10
b = 3
# + 加，两个对象相加
c = a + b
print("a + b =", c)
# - 减，取负数或两个对象相减
c = -a
print("-a =", c)
c = a - b
print("a - b =", c)
# * 乘，两个数相乘或返回一个被重复若干次的字符串
c = a * b
print("a * b =", c)
c = 'abc' * 3
print("'abc' * 3 =", c)
# / 除，返回两个数相除的结果，得到浮点数
c = a / b
print("a / b =", c)
# % 取模，返回两个数相除的余数
c = a % b
print("a % b =", c)
# ** 幂，a**b表示返回a的b次幂
c = a ** b
print("a ** b =", c)
# // 取整除，返回两个数相除后商的整数部分
c = a // b
print("a // b =", c)
input()


# ----------------------------------------
# 比较(关系)运算符：==、!=、>、<、>=、<=
# ----------------------------------------
# == 等于，比较两个对象是否相等
if a == b:
    print("a等于b")
else:
    print("a不等于b")
# != 不等于，比较两个对象是否不相等
if a != b:
    print("a不等于b")
else:
    print("a等于b")
# > 大于，如果a大于b，返回True；否则，返回False
if a > b:
    print("a大于b")
else:
    print("a小于b")
# < 小于，如果a小于b，返回True；否则，返回False
if a < b:
    print("a小于b")
else:
    print("a大于b")
# >= 大于等于，如果a大于等于b，返回True；否则，返回False
if a >= b:
    print("a大于等于b")
else:
    print("a小于b")
# <= 小于等于，如果a小于等于b，返回True；否则，返回False
if a <= b:
    print("a小于等于b")
else:
    print("a大于b")
input()


# ----------------------------------------
# 赋值运算符：=、+=、-=、*=、/=、%=、**=、//=
# ----------------------------------------
# = 简单的赋值运算符
c = a + b
print("a + b =", c)
# += 加法赋值运算符 c += a 等效于 c = c + a
c += a
print("c += a, c =", c)
# -= 减法赋值运算符 c -= a 等效于 c = c - a
c -= a
print("c -= a, c =", c)
# *= 乘法赋值运算符 c *= a 等效于 c = c * a
c *= a
print("c *= a, c =", c)
# /= 除法赋值运算符 c /= a 等效于 c = c / a
c /= a
print("c /= a, c =", c)
# %= 取模赋值运算符 c %= a 等效于 c = c % a
c %= a
print("c %= a, c =", c)
# **= 幂赋值运算符 c **= a 等效于 c = c ** a
c **= a
print("c **= a, c =", c)
# //= 取整除赋值运算符 c //= a 等效于 c = c // a
c //= a
print("c //= a, c =", c)
input()


# ----------------------------------------
# 逻辑运算符：and、or、not
# ----------------------------------------
a = True
b = False
# and 与运算，当所有条件都为True时才返回True，否则返回False
if a and b:
    print("变量a和b都为True")
else:
    print("变量a和b其中一个为False，或者都为False")

# or 或运算，只要满足其中一个条件为True就返回True，否则返回False
if a or b:
    print("变量a和b其中一个为True，或者都为True")
else:
    print("变量a和b都为False")

# not 非运算，当变量为True时返回False，变量为False时返回True
if not a:
    print("变量a为False")
else:
    print("变量a为True")
input()


# ----------------------------------------
# 位运算符：&、|、^、~、<<、>>
# ----------------------------------------
a = 60          # 60 = 0011 1100    60的二进制数
b = 13          # 13 = 0000 1101    13的二进制数
# & 按位与运算符：参与运算的两个值，如果两个相应的二进制位都为1，则该位的结果为1，否则为0
c = a & b       # 12 = 0000 1100
print("a & b的值为：", c)
# | 按位或运算符：只要对应的两个二进制位有一个为1，该结果位就为1，否则为0
c = a | b       # 61 = 0011 1101
print("a | b的值为：", c)
# ^ 按位异或运算符：当两个对应的二进制位相异时，该结果位为1，否则为0
c = a ^ b       # 49 = 0011 0001
print("a ^ b的值为：", c)
# ~ 按位取反运算符：对数据的每个二进制位取反，即把1变为0，把0变为1
c = ~a          # -61 = 1100 0011
print("~a的值为：", c)
# << 左移动运算符：把左边运算数的各二进位全部进行左移，移动的位数由右边的运算数指定。高位丢弃，低位补0
c = a << 2      # 240 = 1111 0000
print("a << 2的值为：", c)
# >> 右移动运算符：把左边运算数的各二进位全部进行右移，移动的位数由右边的运算数指定。低位丢弃，高位补0
c = a >> 2      # 15 = 0000 1111
print("a >> 2的值为：", c)
input()


# ----------------------------------------
# 成员运算符：in、not in
# ----------------------------------------
a = '荷花'
b = '黄花'
flowers = ['桂花', '菊花', '玫瑰', '牡丹', '荷花']
# in 如果指定的元素在后面的序列中则返回True，否则返回False
if a in flowers:
    print("变量a在列表flowers中")
else:
    print("变量a不在列表flowers中")
# not in 如果指定的元素不在后面的序列中则返回True，否则返回False
if b not in flowers:
    print("变量b不在列表flowers中")
else:
    print("变量b在列表flowers中")
input()

# ----------------------------------------
# 身份运算符：is、is not
# ----------------------------------------
a = 'Python2'
b = 'Python3'
# is 判断两个标识符是不是引用自同一个对象。如果引用的是同一个对象则返回True，否则返回False
if a is b:
    print("a和b有相同的标识")
else:
    print("a和b没有相同的标识")
# is not 判断两个标识符是不是引用自不同的对象。如果引用的不是同一个对象则返回True，否则返回False
if a is not b:
    print("a和b没有相同的标识")
else:
    print("a和b有相同的标识")
